# 175. Combine Two Tables

# SQL
SELECT Person.firstName, Person.lastName, Address.city, Address.state  
FROM Person 

# have to use left join because it includes those with NULL
LEFT JOIN Address ON Person.personId = Address.personId

In [6]:
# using pandas df
import pandas as pd

data = [[1, 'Wang', 'Allen'], [2, 'Alice', 'Bob']]
person = pd.DataFrame(data, columns=['personId', 'firstName', 'lastName']).astype({'personId':'Int64', 'firstName':'object', 'lastName':'object'})
data = [[1, 2, 'New York City', 'New York'], [2, 3, 'Leetcode', 'California']]
address = pd.DataFrame(data, columns=['addressId', 'personId', 'city', 'state']).astype({'addressId':'Int64', 'personId':'Int64', 'city':'object', 'state':'object'})

In [ ]:

def combine_two_tables(person: pd.DataFrame, address: pd.DataFrame) -> pd.DataFrame:
    
    # merging the dataframe together first
    result = pd.merge(person, address, on='personId', how='left')

    result = result[['firstName', 'lastName', 'city', 'state']]

    return result

In [5]:
combine_two_tables(person, address)

  firstName lastName           city     state
0      Wang    Allen            NaN       NaN
1     Alice      Bob  New York City  New York

# REDO

In [12]:
import pandas as pd

def combine_two_tables(person: pd.DataFrame, address: pd.DataFrame) -> pd.DataFrame:
    # crete a left join to keep the null
    df = person.merge(address, how='left', left_on='personId', right_on='personId')

    # return as a df rather than an array
    return df[['firstName', 'lastName', 'city', 'state']]

In [10]:
combine_two_tables(person, address)

   personId firstName lastName  addressId           city     state
0         1      Wang    Allen       <NA>            NaN       NaN
1         2     Alice      Bob          1  New York City  New York

In [ ]:
df = person

print(df)

# comparing df['column'] against a value creates a boolean Series like: 
# the_boolean_series = [True, False, True, ...]
# This Series is then used to filter df itself: df[the_boolean_series]

print(df[ [False, True] ])

   personId firstName lastName
0         1      Wang    Allen
1         2     Alice      Bob
   personId firstName lastName
1         2     Alice      Bob

# SQL TIME
SELECT p.firstName, p.lastName, a.city, a.state
FROM Person p 
LEFT JOIN Address a ON p.personId = a.personID

# DIFFERENT TYPE OF JOINS

DATAFRAME
A:  A1  A2  A3
B:      B2  B3  B4

1. INNER JOIN (DEFAULT)
returns the overlaps only

INNER JOIN result:
       A2 B2
       A3 B3

2. LEFT JOIN
returns everything on the left and anything that is matched to the left

LEFT JOIN result:
A1   NULL
A2   B2
A3   B3

3. RIGHT JOIN
returns everything on the right and anything that is matched to the right

RIGHT JOIN result:
A2   B2
A3   B3
NULL B4

4. OUTER JOIN
returns everything in both tables merged together

A1   NULL
A2   B2
A3   B3
NULL B4

# same?? YESSS

SELECT * 
in A
LEFT JOIN B ON A.key = B.key;

SELECT * 
in B
RIGHT JOIN A ON A.key = B.key;